etc/OpenFOAM_Sample_Files/originalFromTheodore/Atrium2D/system/controlDict
/*--------------------------------*- C++ -*---------------------------------*\
| =========                |                                                 |
| \      /  F ield         | foam-extend: Open Source CFD                    |
|  \    /   O peration     | Version:     3.1                                |
|   \  /    A nd           | Web:         http://www.extend-project.de       |
|    \/     M anipulation  |                                                 |
\*--------------------------------------------------------------------------*/
FoamFile 

{

version     2.0;

format      ascii;

class       dictionary;

location    system;

object      controlDict;

}
application
default;

startFrom
startTime;

startTime
0;

stopAt
endTime;

endTime
300;

deltaT
1;

writeControl
timeStep;

writeInterval
100;

purgeWrite
0;

writeFormat
ascii;

writePrecision
6;

writeCompression
uncompressed;

timeFormat
general;

timePrecision
6;

runTimeModifiable
true;

graphFormat  
raw;








functions
{
probes
{
// Where to load it from
functionObjectLibs ( "libsampling.so" );
type probes;
// Name of the directory for probe data
name probes;
// Write at same frequency as fields
outputControl outputTime;
outputInterval 5;
// Fields to be probed
fields
(
p U
);
probeLocations
(
( 1e-06 0 0.01 ) // at inlet
( 0.21 -0.20999 0.01 ) // at outlet1
( 0.21 0.20999 0.01 ) // at outlet2
( 0.21 0 0.01 ) // at central block
);
}
}

