etc/OpenFOAM_Sample_Files/originalFromTheodore/Atrium2D/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*---------------------------------*\
| =========                |                                                 |
| \      /  F ield         | foam-extend: Open Source CFD                    |
|  \    /   O peration     | Version:     3.1                                |
|   \  /    A nd           | Web:         http://www.extend-project.de       |
|    \/     M anipulation  |                                                 |
\*--------------------------------------------------------------------------*/


FoamFile 

{

version     2.0;


format      ascii;


class       dictionary;


object      blockMeshDict;


}


vertices

(
(10 -100 0)

(11 -100 0)

(11 200 0)

(10 200 0)

(10 -100 50)

(11 -100 50)

(11 200 50)

(10 200 50)
);




blocks
(
	

hex (0 1 2 3 4 5 6 7) 
	(1 50 25)


simpleGrading (


1

(
(0.30 0.26 1)    

(0.20 0.48 1)   

(0.50 0.26 1)
)


(
(0.35 0.8 1)    

(0.65 0.2 1)

)
)


);




/*or the below can be used instead of multi-grading above.
simpleGrading ((1 1 1))*/


boundary
(


frontAndBack //X-direction is empty
    
{
        

type empty;
        
faces
    (
            
(2 6 5 1)
             
(0 4 7 3)
        
	 );
    
}

    

inlet
    {
        

type patch;
        
faces
     (
           
	
(1 5 4 0)
        
	  );
    
}

    

outlet
    {
        

type patch;
        
faces
   (
           
	 
(3 7 6 2)
        
	);
    
}

    

lowerWall
    {
        

type wall;
        
faces
        (
            
(0 3 2 1)
        );
    
}

   

upperWall
    {
        

type patch;
       
 faces
        (
            
(4 5 6 7)
        );
    
}


);
