etc/OpenFOAM_Sample_Files/originalFromTheodore/Atrium2D/system/snappyHexMeshDict
/*--------------------------------*- C++ -*---------------------------------*\
| =========                |                                                 |
| \      /  F ield         | foam-extend: Open Source CFD                    |
|  \    /   O peration     | Version:     3.1                                |
|   \  /    A nd           | Web:         http://www.extend-project.de       |
|    \/     M anipulation  |                                                 |
\*--------------------------------------------------------------------------*/
FoamFile 

{

version     2.0;

format      ascii;

class       dictionary;

object      snappyHexMeshDict;

}


castellatedMesh
true;
snap
true;
addLayers
true;


geometry
{
	

	Envelope.stl
	{
		type triSurfaceMesh;
		name Envelope_1;
	}

    /*refinementBox
    {
        type searchableBox;
        min (-5 0 0);
        max ( 65  60 15);
    }*/


};


castellatedMeshControls
{


maxLocalCells
1000000;


maxGlobalCells
8000000;


minRefinementCells
10;


maxLoadUnbalance
0.10;


nCellsBetweenLevels
3;


features
(
);


refinementSurfaces {


		Envelope_1
		{
			level (1  1);
		}


	}


resolveFeatureAngle
30;


refinementRegions
    {
       /* refinementBox
        {
            mode inside;
            levels ((1E15 1));
        }*/
    }


locationInMesh
(10.5 1 40);

allowFreeStandingZoneFaces true;
}


snapControls
{


nSmoothPatch
3;


tolerance
4.0;


nSolveIter
30;


nRelaxIter
5;




}


addLayersControls
{


relativeSizes
true;


layers
{
        Envelope_1
        {
            nSurfaceLayers 1;
        }
      
}


expansionRatio
1.0;


finalLayerThickness
0.3;


minThickness
0.1;


nGrow
1;


featureAngle
30;


nRelaxIter
3;


nSmoothSurfaceNormals
1;


nSmoothThickness
10;


nSmoothNormals
3;


maxFaceThicknessRatio
0.5;


maxThicknessToMedialRatio
0.3;


minMedianAxisAngle
130;


nBufferCellsNoExtrude
0;


nLayerIter
50;


}


meshQualityControls
{


maxNonOrtho
60;


maxBoundarySkewness
20;
maxInternalSkewness
4;


maxConcave
80;


minFlatness
0.5;


 minVol
 1e-13;

minTetQuality 1e-15;

 minArea
 -1;


 minTwist
 0.02;


 minDeterminant
 0.001;


 minFaceWeight
 0.02;


 minVolRatio
 0.01;


 minTriangleTwist
 -1;


 nSmoothScale
 4;


 errorReduction
 0.75;


 }


debug
0;


mergeTolerance
1E-6;
