etc/OpenFOAM_Sample_Files/originalFromTheodore/Atrium2D/0/initialConditions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

flowVelocity         (0 2.8 0);
pressure             0;
turbulentKE          0.48;
turbulentOmega       0.1;
#inputMode           merge

// ************************************************************************* //
