etc/OpenFOAM_Sample_Files/originalFromTheodore/Atrium2D/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "initialConditions"

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform $turbulentKE;

boundaryField
{
	//#include "fixedInlet"
	#include 	"ABLConditions"
   
 inlet
{
	type 		uniformFixedValue;
	uniformValue 	$turbulentKE;
}
    
    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    lowerWall
    {
        type            kqRWallFunction;
        value           $internalField;
    }
    Envelope_1
    {
        type            kqRWallFunction;
        value           $internalField;
    }

    

    #include "frontBackUpperPatches"
}

// ************************************************************************* //
