etc/OpenFOAM_Sample_Files/originalFromTheodore/Atrium2D/system/probesDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      probesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Fields to be probed. runTime modifiable!
fields
(
    p
);

// Locations to be probed. runTime modifiable!
probeLocations
(
    (5.0 5.0 0.0)
    (55 30 9)
   
);

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
